app/controllers/budgets_controller.rb

    def index
        @budgets = Budget.all
---
SELECT "budgets".* FROM "budgets"

    def home
        owners = ["Ally", "McKay"]
        owners.each { |owner| update_allowance(owner)}
        time_range = time_range_for( Time.now.year, Time.now.month )
        @budgets   = Budget.where(spent_on: time_range).order(:spent_on)
        @new_entry = Budget.new

        ally_allowance = Allowance.find_by(owner: "Ally")
        mckay_allowance = Allowance.find_by(owner: "McKay")

        @ally_spent = 0.0
        @mckay_spent = 0.0

        @budgets.each do |budget|
---
SELECT "budgets".* FROM "budgets" WHERE ("budgets"."spent_on" >= '2015-11-30 23:59:59.000000' AND "budgets"."spent_on" < '2015-12-31 00:00:00.000000')  ORDER BY "budgets"."spent_on" ASC
SELECT  "allowances".* FROM "allowances" WHERE "allowances"."owner" = ? LIMIT 1  [["owner", "Ally"]]
SELECT "budgets".* FROM "budgets"

    def show
        @budget = Budget.find(params[:id])
---
SELECT  "budgets".* FROM "budgets" WHERE "budgets"."id" = ? LIMIT 1  [["id", 1]]

    def create
        params[:budget][:spent_on] = format_date(params[:budget][:spent_on])
        @budget = Budget.new(budget_param)

        if @budget.save
---
INSERT INTO "budgets" ("owner", "description", "amount", "spent_on", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["owner", "e"], ["description", "fd"], ["amount", 32.0], ["spent_on", "2015-11-29"], ["created_at", "2015-11-30 05:34:38.257918"], ["updated_at", "2015-11-30 05:34:38.257918"]]

    def edit
        @budget = Budget.find(params[:id])
---
SELECT  "budgets".* FROM "budgets" WHERE "budgets"."id" = ? LIMIT 1  [["id", 1]]

    def update
        @budget = Budget.find(params[:id])

        if @budget.update_attributes(budget_param)
---
SELECT  "budgets".* FROM "budgets" WHERE "budgets"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "budgets" SET "owner" = ?, "description" = ?, "amount" = ?, "spent_on" = ?, "updated_at" = ? WHERE "budgets"."id" = ?  [["owner", "Ally"], ["description", "Christmas"], ["amount", 32.32], ["spent_on", "2015-10-14"], ["updated_at", "2015-11-30 05:38:03.791556"], ["id", 3]]

    def destroy
        Budget.find(params[:id]).destroy
---
DELETE FROM "budgets" WHERE "budgets"."id" = ?  [["id", 4]]
SELECT  "budgets".* FROM "budgets" WHERE "budgets"."id" = ? LIMIT 1  [["id", 4]]